app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.new({title: params[:school_class][:title], room_number: params[:school_class][:room_number]})
    if @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Parenting 101"], ["room_number", 101], ["created_at", "2020-03-30 07:22:19.564158"], ["updated_at", "2020-03-30 07:22:19.564158"]]

  def update
    @school_class.update(school_class_params(:title, :room_number))
---
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Parenting 104"], ["updated_at", "2020-03-30 09:12:31.536644"], ["id", 1]]

  def set_find
    @school_class = SchoolClass.find_by(id: params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]