app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Dee"], ["last_name", "Licious"], ["created_at", "2020-03-30 07:56:33.565148"], ["updated_at", "2020-03-30 07:56:33.565148"]]
---
  def create
    @student = Student.new(first_name: params[:student][:first_name], last_name: params[:student][:last_name])
    if @student.save

UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Taylor"], ["updated_at", "2020-05-05 01:33:43.208825"], ["id", 4]]
---
  def update
    @student.update(student_params(:first_name, :last_name))

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def set_student
    @student = Student.find_by(id: params[:id])